## 03-Financial-Analysis-Pandas - Day 1 - JupyterLab & Pandas

### Class Objectives

* Work comfortably in the JupyterLab IDE.
* Understand the relationship between Python and Pandas.
* Understand the benefits of Pandas over spreadsheets to manipulate data for financial use cases.
* Create Pandas Series and DataFrame structures from scratch and be able to manipulate them.
* Create DataFrames from CSV files.

### Resorces:
* [JupyterLab Overview](https://jupyterlab.readthedocs.io/en/stable/getting_started/overview.html)
* [Getting Started with Pandas](https://pandas.pydata.org/docs/getting_started/index.html)
* [Pandas Series](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html)
* [Pandas DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html)

### Install:
* `conda install pandas -y` or `pip install pandas`
```bash
conda install -c conda-forge nb_conda_kernels -y
conda activate dev
conda install ipykernel -y
conda deactivate
```

# ================================

### 1.01 Instructor Do: Introducing JupyterLab (10 mins)

#### This instructor-led activity is designed to build student confidence with regard to working in the JupyterLab interface.

In [1]:
# A comment begins with a hashtag
# Run this cell by hitting the "single-play" arrow icon

num_1 = 3
num_2 = 7

In [2]:
# Create the variable
sum = num_1 + num_2

# Print the variable
sum

10

In [3]:
# Content can also be printed using the print function
print(num_1 + num_2)

10

In [4]:
# A cell can be added with the "+" icon
# Once a cell is added it can be a designated as a "Code" cell or a "Markdown" cell

## Markdown Cells

A Markdown cell is created by selecting the Markdown option from the dropdown menu associated with the Launcher menu. 
A Markdown cell allows you to use Markdown syntax to communicate insights via text.
All markdown syntax works in a Markdown cell.

In [5]:
# This cell can be removed with the scissors icon

In [6]:
# Additional cell functionality is found under "Edit" on the Main Menu bar
# This functionality includes moving cells up and down, splitting cells or merging cells

In [7]:
banks_list = ["Chase", "Fifth Third", "Wachovia", "Bank of America"]

In [8]:
# Cells must be run in order in order to variables to be put into memory correctly

In [9]:
# You can write functions and use f-strings
i = 0

for bank in banks_list:
    print(f"The name of the bank in index position {i} is {bank}.")
    i += 1

The name of the bank in index position 0 is Chase.
The name of the bank in index position 1 is Fifth Third.
The name of the bank in index position 2 is Wachovia.
The name of the bank in index position 3 is Bank of America.

In [10]:
# The entire notebook can be cleared and rerun from top to bottom
# by selecting the "double-play" arrow icon.

# ================================

### 1.02 Student Do: Working in JupyterLab (10 mins)

# Working in JupyterLab

In this activity, you will build familiarity working with a Jupyter notebook inside the JupyterLab environment.


## Instructions

1. Create a folder called `JupyterLab_Practice` on your computer's desktop.

2. Open your terminal (Terminal for Mac users and Git Bash for Windows users) and navigate to the `JupyterLab_Practice` folder.

3. Activate your Conda `dev` environment.

4. With the `dev` environment active, launch JupyterLab.

5. Open the visible Launcher tab  as a Python 3 notebook.

6. Right-click on the tab and select "Rename Notebook..." Name the notebook `notebook_practice.ipynb`.

7. In `notebook_practice.ipynb`, complete the following actions:

    * Add a new cell that contains two variables. Assign the variables numeric values.
    
    * Add a new cell and assign it as a Markdown cell. Include a header and some text.
    
    * Add a new cell that includes both a comment and a variable and that adds together the two numeric variables you created earlier. Write the code to print the value of this variable.
    
    * Navigate back to the first cell and run each cell individually using the single-play arrow icon.
    
    * Add a new cell that includes a variable and that multiplies the two numeric variables you created earlier. Write the code to print the value of this variable,  using the `print` function and an f-string.
    
    * Using the double-play arrow icon, restart and run the notebook from the beginning.
    
    * Cut the Markdown cell that was created above.

In [11]:
# Create 2 variables and give them numeric values.
# YOUR CODE HERE!

## Markdown Cell

To create a Markdown cell, you add a **new** cell to the notebook, and the select Markdown from the dropdown menu associated with the tab.

In [12]:
# Add a new cell that includes both a comment and a variable that 
# adds together the two numberic variables you created earlier. 
# Write the code to print the value of this variable.

# Write the code to print the value of this variable.
# YOUR CODE HERE!

743.7

In [13]:
# Add a new cell that includes a variable that multiplies together 
# the two numeric variables you created earlier. 


# Write the code to print the value this variable using the print function and an f-string.
# YOUR CODE HERE!

You can use f-strings to print the value of variables like 425.7 and 318, as well as the result 135372.6.

# ================================

### 1.03 Instructor Do: Introducing the Pandas Series (15 mins)

[Pandas Series](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html)

```bash
conda activate dev
conda list
```

In [1]:
# Import the pandas module and alias it as 'pd'
import pandas as pd

 # List Example

In [2]:
# Create a list
list_of_numbers = [12, 0, 55, 12, 12]

 ## Type Checking

In [4]:
# Check type of list_of_numbers
type(list_of_numbers)

[12, 0, 55, 12, 12]

In [5]:
# Check type of an element in list_of_numbers
type(list_of_numbers[0])

int

In [6]:
# Create a Series from the list
series_of_numbers = pd.Series(list_of_numbers)

In [9]:
# Check type of series_of_numbers
type(series_of_numbers)

pandas.core.series.Series

In [10]:
# Print the Series
print(series_of_numbers)

0    12
1     0
2    55
3    12
4    12
dtype: int64

 # Series Attributes

In [11]:
# Return the data type of the elements in the series
series_of_numbers.dtypes

dtype('int64')

In [16]:
# Return the element at index 0 using iloc
series_of_numbers.iloc[0]

12

In [23]:
# Return the element at index 0 using list syntax
series_of_numbers[0]

12

 # Series Methods

In [17]:
# Get the count of the number of times a value occurs in a Series
series_of_numbers.value_counts()

12    3
55    1
0     1
dtype: int64

In [18]:
# Get the unique values of a Series
series_of_numbers.unique()

array([12,  0, 55], dtype=int64)

In [20]:
# A function to triple any value
def triple_value(some_value):
    return some_value * 3

# Apply triple value to series_of_numbers
series_of_numbers.apply(triple_value)

0     36
1      0
2    165
3     36
4     36
dtype: int64

 # Dictionary Example

In [22]:
# A dictionary of stock values
stock_values = {"MSFT": 160, "AAPL": "75.09", "TWTR": 32.3}
stock_values

{'MSFT': 160, 'AAPL': '75.09', 'TWTR': 32.3}

In [23]:
# Create series object from dictionary
stock_series = pd.Series(stock_values)

print(stock_series)

MSFT      160
AAPL    75.09
TWTR     32.3
dtype: object

In [29]:
 ## Datatype conversion

In [24]:
# Return the data type of the elements in the series
stock_series.dtypes

dtype('O')

In [25]:
# Apply float to each item in the series
stock_series = stock_series.apply(float)

In [26]:
# Return the data type of the elements in the series
stock_series.dtypes
print(stock_series)

MSFT    160.00
AAPL     75.09
TWTR     32.30
dtype: float64

 ## Different Methods to Access Values

In [28]:
# Access value at index location 0 using iloc
print(stock_series.iloc[0])
print(stock_series.loc["AAPL"])

# Access value at index location 0 using list syntax
print(stock_series[0])

# Access value at index MSFT
print(stock_series["MSFT"])

160.0
75.09
160.0
160.0

 ## Appending Data to Series

In [30]:
# Create a new stock series for google stock. The dictionary is passed in directly.
google_stock_series = pd.Series({"GOOGL": 1754.40})
google_stock_series

GOOGL    1754.4
dtype: float64

In [33]:
# Append the new data without reassignment
stock_series.append(google_stock_series)

MSFT      160.00
AAPL       75.09
TWTR       32.30
GOOGL    1754.40
dtype: float64

In [37]:
# Append the new data with reassignment
stock_series = stock_series.append(google_stock_series)

print(stock_series)

MSFT      160.00
AAPL       75.09
TWTR       32.30
GOOGL    1754.40
GOOGL    1754.40
GOOGL    1754.40
GOOGL    1754.40
dtype: float64

 ## Removing Data from Series

In [39]:
# Drop MSFT in-place
stock_series.drop("GOOGL", inplace=True)

print(stock_series)

AAPL    75.09
TWTR    32.30
dtype: float64

 ## Updating Series Data

In [41]:
# Update using list syntax
stock_series[1] = 35

print(stock_series)

AAPL    75.09
TWTR    35.00
dtype: float64

In [42]:
# Update using named index label
stock_series["AAPL"] = 50

print(stock_series)

AAPL    50.0
TWTR    35.0
dtype: float64

 ## Iterating Over Series

In [44]:
# Print prices
for price in stock_series:
    print(price)

50.0
35.0

In [45]:
# Print symbol and price
for symbol, price in stock_series.items():
    print(f"{symbol} - {price}")

AAPL - 50.0
TWTR - 35.0

# ================================

### 1.04 Student Do: A Series of New Friends (10 mins)

# A Series of New Friends

In this activity, you will learn more about your classmates by collecting their names and current job roles and then storing them in a Series.

## Instructions

1. Import the required libraries and dependencies.

2. Each person in the breakout group should share their name and current job role. Then, create a dictionary where the keys are your classmates' names and the values are their current job roles.

3. Create a Series from the dictionary.

4. Create a new dictionary and a new Series that has one or more of your personal heroes and their job role(s).

5. Append the Series of personal heroes to the Series containing your classmates' information.

6. Iterate over the Series and, in a nicely formatted way, print the names and job roles in the Series.

When you return from the breakout room, paste your solution in the class Slack channel.

In [42]:
# Import the Pandas Library
# YOUR CODE HERE

## Ask each classmate in the breakout group their name and current job role. Create a dictionary where the keys are your classmates' names and the values are their current job role.

In [43]:
# Create dictionary of classmates and their job roles
# YOUR CODE HERE

## Create a `Series` from the dictionary.

In [44]:
# Create a series from the dictionary
# YOUR CODE HERE

# View the Series
# YOUR CODE HERE

David        Financial Analyst
Susan       Software Developer
Zachary         Account Manger
Kris       Electrical Engineer
dtype: object

## Create both a new dictionary and new `Series` that has one or more of your personal heroes and their job role(s).

In [45]:
# Create a dictionary of personal heroes
# YOUR CODE HERE

In [46]:
# Create a series from the dictionary
# YOUR CODE HERE

# View the Series
# YOUR CODE HERE

Claude Shannon       Information Scientist
Benoit Mandelbrot            Mathematician
Noam Chomsky                      Linguist
dtype: object

## Append the `Series` of personal heroes to the Series containing your classmates information.

In [47]:
# Append the series_of_heroes to the series_of_interesting_people
# YOUR CODE HERE

## Iterate over the `Series` and, in a nicely formatted way, print the names and job roles in the `Series`.

In [48]:
# Iterate over the series_of_interesting_people and print names and job role of each
# YOUR CODE HERE

David - Financial Analyst
Susan - Software Developer
Zachary - Account Manger
Kris - Electrical Engineer
Claude Shannon - Information Scientist
Benoit Mandelbrot - Mathematician
Noam Chomsky - Linguist

# ================================

### 1.05 Instructor Do: Introduce the Pandas Dataframe (15 mins)

[Pandas DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html)

In [49]:
# Import Modules
import pandas as pd

 # DataFrame from Series

In [48]:
my_dict = [
    {"MSFT": 160.32, "AAPL": 75.11, "TWTR": 32.52},
    {"MSFT": 158.23, "AAPL": 77.65, "TWTR": 33.08}
]
my_dict

[{'MSFT': 160.32, 'AAPL': 75.11, 'TWTR': 32.52},
 {'MSFT': 158.23, 'AAPL': 77.65, 'TWTR': 33.08}]

In [50]:
my_list = {
    "MSFT": [160.32, 158.23],
    "AAPL": [75.11, 77.65],
    "TWTR": [32.52, 33.08]
}

In [54]:
pd.DataFrame(my_dict, index=["Open", "Close"])

         MSFT   AAPL   TWTR
Open   160.32  75.11  32.52
Close  158.23  77.65  33.08

In [70]:
pd.DataFrame(my_list, index=["Open", "Close"]).transpose()

        Open   Close
MSFT  160.32  158.23
AAPL   75.11   77.65
TWTR   32.52   33.08

In [53]:
# Create two series
opening_prices = pd.Series(
    {"MSFT": 160.32, "AAPL": 75.11, "TWTR": 32.52}, name="Opening Price"
)

closing_prices = pd.Series(
    {"MSFT": 158.23, "AAPL": 77.65, "TWTR": 33.08}, name="Closing Price"
)

In [56]:
# Create DataFrame
prices_df = pd.DataFrame(data=[opening_prices, closing_prices])

# Show DataFrame
prices_df

                 MSFT   AAPL   TWTR
Opening Price  160.32  75.11  32.52
Closing Price  158.23  77.65  33.08

 ## Transposition

In [71]:
# Transpose prices_df
prices_df.T

      Opening Price  Closing Price
MSFT         160.32         158.23
AAPL          75.11          77.65
TWTR          32.52          33.08

In [72]:
# Save T output to prices_df
prices_df = prices_df.T

# Show DataFrame
prices_df

      Opening Price  Closing Price
MSFT         160.32         158.23
AAPL          75.11          77.65
TWTR          32.52          33.08

 ## Accessing Columns

In [73]:
# Access the Opening Price column
prices_df["Opening Price"]

MSFT    160.32
AAPL     75.11
TWTR     32.52
Name: Opening Price, dtype: float64

In [76]:
# Check type of column
type(prices_df["Opening Price"])

pandas.core.series.Series

In [77]:
# Retrieve AAPL opening price by location
prices_df["Opening Price"][1]

75.11

In [78]:
# Retrieve AAPL opening price by key
prices_df["Opening Price"]["AAPL"]

75.11

 ## Accessing Rows

In [83]:
# Retrieve the MSFT row
prices_df.loc["MSFT", ["Opening Price", "Closing Price"]]

Opening Price    160.32
Closing Price    158.23
Name: MSFT, dtype: float64

In [84]:
# Check type
type(prices_df.loc["MSFT"])

pandas.core.series.Series

In [85]:
# Retrieve MSFT closing price by key
prices_df.loc["MSFT"]["Closing Price"]

158.23

In [86]:
# Retrieve MSFT closing price by location
prices_df.loc["MSFT"][1]

158.23

 # DataFrame from Dictionary of a list

In [88]:
# Dictionary of temperature values
daily_temperature_range = {
    "Monday": [50, 75],
    "Tuesday": [52, 73],
    "Wednesday": [53, 73],
    "Thursday": [55, 80],
    "Friday": [56, 79],
    "Saturday": [55, 81],
    "Sunday": [55, 80],
}

In [89]:
# Create DataFrame
temperature_df = pd.DataFrame(data=daily_temperature_range, index=["Low", "High"])

# Show DataFrame
temperature_df

      Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  Sunday
Low       50       52         53        55      56        55      55
High      75       73         73        80      79        81      80

In [90]:
# DataFrame transposition
temperature_df = temperature_df.T

# Show the DataFrame
temperature_df

           Low  High
Monday      50    75
Tuesday     52    73
Wednesday   53    73
Thursday    55    80
Friday      56    79
Saturday    55    81
Sunday      55    80

In [91]:
# Check type
type(temperature_df["Low"])

pandas.core.series.Series

In [92]:
# Check type
type(temperature_df.loc["Monday"])

pandas.core.series.Series

# ================================

### 1.06 Student Do: A Friends DataFrame (15 mins)

# A Friends DataFrame

In this group activity, you will share your name, location, years of software experience, and technologies you have used. You will then create a DataFrame to store the data and calculate the average age of your group using the `mean` method.

## Background

To learn more about the `mean` method, refer to the ["Methods" section in the Pandas documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html). 

## Instructions

1. Import the required libraries and dependencies.

2. Each person in the breakout room should share their name, location, years of software experience, and technologies they have used. Create a dictionary where the keys are your classmates' names and the other values are stored in a list.

For example:

```python
my_classmates = {
  "Anna": ["London",1,"Java"],
  "Mohammad" : ["Chicago",0,"Microsoft Office"],
}
```

3. Create a Pandas DataFrame, using the my_classmates dictionary as the data. **Hint:** Use the `index` parameter and label the column names with ["City", "Software Experience", "Technologies Used"]. 

4. Transpose the DataFrame.

5. View the data in the DataFrame's City column.

6. Using the `mean` method, calculate the average years of software experience of the group.

7. For one of your classmates, increase their years of software experience by 1 year.

Be prepared to share some of your solutions with the class when you return from the breakout room.

## Import the required libraries and dependencies.

In [67]:
# Import the Pandas library
# YOUR CODE HERE

### Ask each classmate in the breakout room their name, location, how many years of software experience they have and what previous technologies they have used. Create a dictionary where the keys are your classmates' names and the other values are stored in a list.

In [68]:
# Create Dictionary
# YOUR CODE HERE

## Create a Pandas `DataFrame` using the my_classmates dictionary as the data.

In [69]:
# Create DataFrame from the my_classmates dictionary
# Hint - Use the `index` parameter and label the 
# column names with ["City", "Software Experience", "Technologies Used"]
# YOUR CODE HERE

# View the resulting DataFrame
# YOUR CODE HERE

                       Anna          Mohammad    Viral     Lizette
City                 London         Hong Kong  Seattle     Chicago
Software Experience       7                 0        5           2
Technologies Used      Java  Microsoft Office       C#  JavaScript

## Transpose the `DataFrame`.

In [70]:
# Transpose DataFrame 
# YOUR CODE HERE

# View the transposed DataFrame
# YOUR CODE HERE

               City Software Experience Technologies Used
Anna         London                   7              Java
Mohammad  Hong Kong                   0  Microsoft Office
Viral       Seattle                   5                C#
Lizette     Chicago                   2        JavaScript

## View the data in the DataFrame's 'City' column.

In [71]:
# View the entries in the DataFrame's "City" column
# YOUR CODE HERE

Anna           London
Mohammad    Hong Kong
Viral         Seattle
Lizette       Chicago
Name: City, dtype: object

## Using the `mean()` method, calculate the average years of software experience of the group.

In [72]:
# Calculate mean value of the group's software experience
# YOUR CODE HERE

3.5

## For one of your classmates, increase their years of software experience by 1 year.

In [73]:
# For one of your classmates, increase their years of software experience by 1 year. 
# YOUR CODE HERE

# Confirm that the change has been made by viewing the DataFrame
# YOUR CODE HERE

               City Software Experience Technologies Used
Anna         London                   7              Java
Mohammad  Hong Kong                   1  Microsoft Office
Viral       Seattle                   5                C#
Lizette     Chicago                   2        JavaScript

# ================================

### 1.07 Instructor Do: Reading CSV Files with Pandas (10 mins)

In [74]:
import pandas as pd
from pathlib import Path

# Reading a CSV file as a Pandas DataFrame

### Step 1: Create a path to the file

In [75]:
# Detail the relative path to the CSV file being imported
csvpath = Path("07-Ins_Reading_CSVs/Resources/sales.csv")

### Step 2: Read the CSV into a DataFrame using Pandas

In [76]:
# Use the Pandas read_csv function, specifiying the relative Path
sales_dataframe = pd.read_csv(csvpath)

## Step 3: Review the DataFrame

In [77]:
# Review the first five rows of the DataFrame with the head function
sales_dataframe.head()

,FullName,Email,Address,Zip,CreditCard,SalePrice
0,Elwanda White,alyre2036@live.com,352 Lakeshore Mall,9236,5327 0855 9720 7055,84.33
1,Lyndon Elliott,arrowy1873@outlook.com,1234 Avery Plaza,1330,3717 498777 19636,879.95
2,Daisey Sellers,toucan2024@outlook.com,469 Elwood Street,7631,3758 579477 35734,907.58
3,Issac Reeves,asarin1958@gmail.com,565 Phelps Field,81168,4400 0380 4162 1622,545.88
4,Bradford Kinney,mibound1801@yandex.com,853 Mission Rock Freeway,41721,3712 263405 60178,517.49

In [78]:
# Review the last five rows of the DataFrame with the head function
# The nubmer of rows viewed can be altered
sales_dataframe.tail()

,FullName,Email,Address,Zip,CreditCard,SalePrice
95,Basil Rios,holloo1814@yahoo.com,605 Sloat Terrace,8108,5581 7245 8451 9384,937.14
96,Hipolito Rios,calefacient2049@gmail.com,1248 Fountain Boulevard,37077,2333 0264 5343 2022,645.82
97,Clayton Robertson,coner2015@live.com,230 Paper Parkway,57242,2414 3939 6501 2607,128.73
98,Tony Chandler,sexillion2061@live.com,118 Flood Plantation,70135,5581 8059 1883 1841,820.00
99,Cuc Mcgowan,dispatched1820@gmail.com,87 Louisiana Grove,70959,2678 4140 5531 3894,764.69

In [79]:
# Review both the head and the tail by incorporating the display function
display(sales_dataframe.head())
display(sales_dataframe.tail(7))

,FullName,Email,Address,Zip,CreditCard,SalePrice
0,Elwanda White,alyre2036@live.com,352 Lakeshore Mall,9236,5327 0855 9720 7055,84.33
1,Lyndon Elliott,arrowy1873@outlook.com,1234 Avery Plaza,1330,3717 498777 19636,879.95
2,Daisey Sellers,toucan2024@outlook.com,469 Elwood Street,7631,3758 579477 35734,907.58
3,Issac Reeves,asarin1958@gmail.com,565 Phelps Field,81168,4400 0380 4162 1622,545.88
4,Bradford Kinney,mibound1801@yandex.com,853 Mission Rock Freeway,41721,3712 263405 60178,517.49

,FullName,Email,Address,Zip,CreditCard,SalePrice
93,Jerrold Luna,cherish1912@yahoo.com,1383 Merrie Crescent,555,4431 5573 4636 2445,126.06
94,Jonas Larsen,going1804@yandex.com,1323 Van Dyke Arcade,7839,2672 8966 5206 2195,323.13
95,Basil Rios,holloo1814@yahoo.com,605 Sloat Terrace,8108,5581 7245 8451 9384,937.14
96,Hipolito Rios,calefacient2049@gmail.com,1248 Fountain Boulevard,37077,2333 0264 5343 2022,645.82
97,Clayton Robertson,coner2015@live.com,230 Paper Parkway,57242,2414 3939 6501 2607,128.73
98,Tony Chandler,sexillion2061@live.com,118 Flood Plantation,70135,5581 8059 1883 1841,820.00
99,Cuc Mcgowan,dispatched1820@gmail.com,87 Louisiana Grove,70959,2678 4140 5531 3894,764.69

In [80]:
# Generate a concise summary of the DataFrame with the info function
# This includes number of columns, the name of the columns, the count of each column, and data type
sales_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   FullName    100 non-null    object
 1   Email       100 non-null    object
 2   Address     100 non-null    object
 3   Zip         100 non-null    int64
 4   CreditCard  100 non-null    object
 5   SalePrice   100 non-null    float64
dtypes: float64(1), int64(1), object(4)
memory usage: 4.8+ KB

In [81]:
# Generate summary statistics of the DataFrame with the describe function
# This will only generate information for numeric columns
# This contains information like count, average, standard deviation, min and max values
sales_dataframe.describe()

                Zip   SalePrice
count    100.000000  100.000000
mean   40952.160000  533.007200
std    30207.118496  275.531072
min      555.000000   29.720000
25%    11109.750000  328.507500
50%    40033.500000  536.110000
75%    65834.750000  767.885000
max    99877.000000  998.760000

# ================================

### 1.08 Student Do: From CSV to DataFrame (10 mins)

In this activity, you will import a CSV file and create a DataFrame with a `DatetimeIndex`.

## Instructions

1. Import the required libraries and dependencies.

2. Using the Pandas `read_csv` function, import the `prices.csv` file from the `Resources` folder into a Pandas DataFrame. The `read_csv` function will take in four parameters: 

    * Using the Path module, specify the relative path to the `prices.csv` file.
    
    * Set the `index_col` parameter to specify the Date column as the index for the DataFrame.
    
    * Set the `parse_dates` parameter to `True`.
    
    * Set the `infer_datetime_format` parameter to `True`.

3. Review the first five rows of the DataFrame using the Pandas `head` function.

4. Review the last five rows of the DataFrame using the Pandas `tail` function.

5. Review both the first and last seven rows of the DataFrame from one cell by calling the Pandas `display` function in conjunction with the `head` and `tail` functions.

6. Review the basic information of the DataFrame by calling the Pandas `info` function.

7. Generate the summary statistics for the DataFrame by calling the Pandas `describe` function.

In [82]:
# Import the Pandas library
# YOUR CODE HERE

# Import the Path module from the pathlib library
# YOUR CODE HERE

## Using the Pandas `read_csv` function, create a Pandas Dataframe by importing the "prices.csv" file from the Resources folder.

The `read_csv` function should take in 4 parameters:

1. Using the Path module, specify the relative path to the "prices.csv" file.
2. Set the `index_col` parameter to specify the "Date" column as the index for the Pandas DataFrame.
3. Set the `parse_dates` parameter to True.
4. Set the `infer_datetime_format` parameter to True.

In [83]:
# Use the `read_csv` function to create the Pandas DataFrame
# YOUR CODE HERE

In [84]:
# Review the first five rows of the DataFrame
# YOUR CODE HERE

              MSFT   AAPL   TWTR
Date
2020-01-02  160.62  75.09  32.30
2020-01-03  158.62  74.36  31.52
2020-01-06  159.03  74.95  31.64
2020-01-07  157.58  74.60  32.54
2020-01-08  160.09  75.80  33.05

In [85]:
# Review the last five rows of the DataFrame
# YOUR CODE HERE

              MSFT   AAPL   TWTR
Date
2020-03-25  146.92  61.38  25.97
2020-03-26  156.11  64.61  26.41
2020-03-27  149.70  61.94  25.29
2020-03-30  160.23  63.70  25.59
2020-03-31  157.71  63.57  24.56

## Review both the first and last seven rows of the DataFrame from one cell by calling the Pandas `display` function in conjunction with the `head` and `tail` functions.

In [86]:
# Review the first and last seven rows of the DataFrame from the same cell
# YOUR CODE HERE
# YOUR CODE HERE

              MSFT   AAPL   TWTR
Date
2020-01-02  160.62  75.09  32.30
2020-01-03  158.62  74.36  31.52
2020-01-06  159.03  74.95  31.64
2020-01-07  157.58  74.60  32.54
2020-01-08  160.09  75.80  33.05
2020-01-09  162.09  77.41  33.22
2020-01-10  161.34  77.58  32.78

              MSFT   AAPL   TWTR
Date
2020-03-23  135.98  56.09  24.69
2020-03-24  148.34  61.72  25.85
2020-03-25  146.92  61.38  25.97
2020-03-26  156.11  64.61  26.41
2020-03-27  149.70  61.94  25.29
2020-03-30  160.23  63.70  25.59
2020-03-31  157.71  63.57  24.56

In [87]:
# Review basic information about the DataFrame
# YOUR CODE HERE

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 62 entries, 2020-01-02 to 2020-03-31
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   MSFT    62 non-null     float64
 1   AAPL    62 non-null     float64
 2   TWTR    62 non-null     float64
dtypes: float64(3)
memory usage: 1.9 KB

In [88]:
# Generate the summary statistics for the DataFrame
# YOUR CODE HERE

             MSFT       AAPL       TWTR
count   62.000000  62.000000  62.000000
mean   164.449032  73.541452  32.349355
std     13.675092   7.303351   4.341601
min    135.420000  56.090000  22.000000
25%    158.290000  68.500000  31.550000
50%    163.895000  75.745000  33.220000
75%    172.307500  79.655000  34.960000
max    188.700000  81.800000  39.050000

# ================================

### 1.09 Instructor Do: Column Manipulation (10 mins)

In [89]:
import pandas as pd
from pathlib import Path

In [90]:
csvpath = Path("09-Ins_Column_Manipulation/Resources/customers.csv")

In [91]:
customer_dataframe = pd.read_csv(csvpath)
customer_dataframe.head()

,FullName,Email,Address,Zip,CreditCard,Balance
0,Altha Frederick,unhideable1966@gmail.com,67 John Maher Extension,31353,2524 2317 2139 4751,21511
1,Nickolas Harvey,allgood1803@outlook.com,1200 Madera Plaza,1922,4756 0997 9568 1329,13850
2,Jesusita Kinney,satsumas1954@yahoo.com,943 Gibb Highway,41535,3717 863466 48574,21254
3,Mose Gordon,antifowl1875@gmail.com,1073 Fell Trace,16098,5413 1700 6989 2835,5221
4,Cesar Valentine,acetaminol1979@yahoo.com,805 Marshall Promenade,99895,5173 4883 9215 4743,8300

### Replace Columns

In [92]:
# Display column names
customer_dataframe.columns

Index(['FullName', 'Email', 'Address', 'Zip', 'CreditCard', 'Balance'], dtype='object')

In [93]:
# Rewrite the column names
columns = ["Full Name", "Email", "Address", "Zip Code", "Credit Card Number", "Account Balance"]
customer_dataframe.columns = columns
customer_dataframe.head()

,Full Name,Email,Address,Zip Code,Credit Card Number,Account Balance
0,Altha Frederick,unhideable1966@gmail.com,67 John Maher Extension,31353,2524 2317 2139 4751,21511
1,Nickolas Harvey,allgood1803@outlook.com,1200 Madera Plaza,1922,4756 0997 9568 1329,13850
2,Jesusita Kinney,satsumas1954@yahoo.com,943 Gibb Highway,41535,3717 863466 48574,21254
3,Mose Gordon,antifowl1875@gmail.com,1073 Fell Trace,16098,5413 1700 6989 2835,5221
4,Cesar Valentine,acetaminol1979@yahoo.com,805 Marshall Promenade,99895,5173 4883 9215 4743,8300

### Rename Columns

In [94]:
customer_dataframe = customer_dataframe.rename(columns={
    "Full Name": "full_name",
    "Credit Card Number": "credit_card_number"
})

customer_dataframe.head()

,full_name,Email,Address,Zip Code,credit_card_number,Account Balance
0,Altha Frederick,unhideable1966@gmail.com,67 John Maher Extension,31353,2524 2317 2139 4751,21511
1,Nickolas Harvey,allgood1803@outlook.com,1200 Madera Plaza,1922,4756 0997 9568 1329,13850
2,Jesusita Kinney,satsumas1954@yahoo.com,943 Gibb Highway,41535,3717 863466 48574,21254
3,Mose Gordon,antifowl1875@gmail.com,1073 Fell Trace,16098,5413 1700 6989 2835,5221
4,Cesar Valentine,acetaminol1979@yahoo.com,805 Marshall Promenade,99895,5173 4883 9215 4743,8300

### Reorder Columns

In [95]:
customer_dataframe = customer_dataframe[['credit_card_number', 'Account Balance', 'full_name', 'Email', 'Address', 'Zip Code']]
customer_dataframe.head()

,credit_card_number,Account Balance,full_name,Email,Address,Zip Code
0,2524 2317 2139 4751,21511,Altha Frederick,unhideable1966@gmail.com,67 John Maher Extension,31353
1,4756 0997 9568 1329,13850,Nickolas Harvey,allgood1803@outlook.com,1200 Madera Plaza,1922
2,3717 863466 48574,21254,Jesusita Kinney,satsumas1954@yahoo.com,943 Gibb Highway,41535
3,5413 1700 6989 2835,5221,Mose Gordon,antifowl1875@gmail.com,1073 Fell Trace,16098
4,5173 4883 9215 4743,8300,Cesar Valentine,acetaminol1979@yahoo.com,805 Marshall Promenade,99895

### Create Columns

In [96]:
customer_dataframe["Balance (1k)"] = customer_dataframe["Account Balance"] / 1000
customer_dataframe.head()

,credit_card_number,Account Balance,full_name,Email,Address,Zip Code,Balance (1k)
0,2524 2317 2139 4751,21511,Altha Frederick,unhideable1966@gmail.com,67 John Maher Extension,31353,21.511
1,4756 0997 9568 1329,13850,Nickolas Harvey,allgood1803@outlook.com,1200 Madera Plaza,1922,13.850
2,3717 863466 48574,21254,Jesusita Kinney,satsumas1954@yahoo.com,943 Gibb Highway,41535,21.254
3,5413 1700 6989 2835,5221,Mose Gordon,antifowl1875@gmail.com,1073 Fell Trace,16098,5.221
4,5173 4883 9215 4743,8300,Cesar Valentine,acetaminol1979@yahoo.com,805 Marshall Promenade,99895,8.300

### Split Columns

In [97]:
names = customer_dataframe["full_name"].str.split(" ", expand=True)
names.head()

          0          1
0     Altha  Frederick
1  Nickolas     Harvey
2  Jesusita     Kinney
3      Mose     Gordon
4     Cesar  Valentine

In [98]:
customer_dataframe["first_name"] = names[0]
customer_dataframe["last_name"] = names[1]
customer_dataframe.head()

,credit_card_number,Account Balance,full_name,Email,Address,Zip Code,Balance (1k),first_name,last_name
0,2524 2317 2139 4751,21511,Altha Frederick,unhideable1966@gmail.com,67 John Maher Extension,31353,21.511,Altha,Frederick
1,4756 0997 9568 1329,13850,Nickolas Harvey,allgood1803@outlook.com,1200 Madera Plaza,1922,13.850,Nickolas,Harvey
2,3717 863466 48574,21254,Jesusita Kinney,satsumas1954@yahoo.com,943 Gibb Highway,41535,21.254,Jesusita,Kinney
3,5413 1700 6989 2835,5221,Mose Gordon,antifowl1875@gmail.com,1073 Fell Trace,16098,5.221,Mose,Gordon
4,5173 4883 9215 4743,8300,Cesar Valentine,acetaminol1979@yahoo.com,805 Marshall Promenade,99895,8.300,Cesar,Valentine

### Delete Columns

In [99]:
customer_dataframe = customer_dataframe.drop(columns=["full_name"])
customer_dataframe.head()

,credit_card_number,Account Balance,Email,Address,Zip Code,Balance (1k),first_name,last_name
0,2524 2317 2139 4751,21511,unhideable1966@gmail.com,67 John Maher Extension,31353,21.511,Altha,Frederick
1,4756 0997 9568 1329,13850,allgood1803@outlook.com,1200 Madera Plaza,1922,13.850,Nickolas,Harvey
2,3717 863466 48574,21254,satsumas1954@yahoo.com,943 Gibb Highway,41535,21.254,Jesusita,Kinney
3,5413 1700 6989 2835,5221,antifowl1875@gmail.com,1073 Fell Trace,16098,5.221,Mose,Gordon
4,5173 4883 9215 4743,8300,acetaminol1979@yahoo.com,805 Marshall Promenade,99895,8.300,Cesar,Valentine

#### Exporting a Dataframe

In [100]:
customer_dataframe.to_csv("09-Ins_Column_Manipulation/Resources/customer_reworked.csv")

# ================================

### 1.10 Student Do: Manipulating DataFrames (10 mins)

In this activity, you will manipulate the structure of a Pandas DataFrame, namely its columns. Altering the structure of a Pandas DataFrame is often necessary to fit the needs of the user.

## Instructions

1. Import the Pandas, pathlib, and NumPy libraries.

2. Create a variable named `csvpath` that represents the path to `people.csv` by using the Path module from the pathlib library.

3. Read the CSV file into a Pandas DataFrame, using the Pandas `read_csv` function and the `csvpath` variable. View the first five rows of the DataFrame.

4. View the column names of the Pandas DataFrame.

5. View the column data types of the Pandas DataFrame.

6. Rename the columns of the Pandas DataFrame to "Person_ID", "First_Name", "Last_Name", "Email", "Gender", "University", "Occupation", and "Salary".

7. Alternatively, rename the columns of the Pandas DataFrame using a dictionary.

8. Re-order the columns of the Pandas DataFrame to "Person_ID", "Last_Name", "First_Name", "Gender", "University", "Occupation", "Salary", and "Email".

### Bonus

If you finish the activity with time to spare, try the following bonus activity. 

1. Create two additional columns: "Age" and "Age_Copy". 

2. Use the `randint` function from the NumPy library with the `low`, `high`, and `size` parameters set to `22`, `65`, and `1000`, respectively, to randomly generate an integer from 22 to 65 for 1000 rows. The following code generates the random values:

    ```python
    np.random.randint(low=22, high=65, size=1000)
    ```

3. Delete the newly created "Age_Copy" column.

4. Using the Pandas `to_csv` function, write the modified DataFrame to a new CSV. Put the file in the `Resources` folder.

In [101]:
# Import the `pandas`, `pathlib` and `numpy` libraries.
# YOUR CODE HERE
# YOUR CODE HERE
# YOUR CODE HERE

## Create a variable `csvpath` that represents the path to the people.csv file using the Path module from the pathlib library.

In [102]:
# Use the Pathlib libary to set the path to the CSV
# YOUR CODE HERE

## Read the CSV into a Pandas DataFrame using the Pandas `read_csv` function and the `csvpath` variable and view the first five rows of the DataFrame.

In [103]:
# Use the file path to read the CSV into a DataFrame 
# YOUR CODE HERE

# View the first five rows of the DataFrame
# YOUR CODE HERE

,id,first_name,last_name,email,gender,uni_grad,job_title,Income
0,1.0,Keriann,Lenormand,klenormand0@businessinsider.com,Female,Aurora University,Nurse Practicioner,58135.0
1,2.0,Huntley,Rupke,hrupke1@reuters.com,Male,Osaka University of Economics,Project Manager,96053.0
2,3.0,Gorden,Dalgarnowch,gdalgarnowch2@microsoft.com,Male,Ludong University,Environmental Tech,59196.0
3,4.0,Cullie,NaN,cputten3@nymag.com,Male,Université des Sciences et de la Technologie d...,Legal Assistant,88493.0
4,5.0,Ariel,Strangman,astrangman4@bravesites.com,Female,Boise State University,Project Manager,89073.0

## View the column names of the Pandas DataFrame.

In [104]:
# Use the `columns` attribute to output the column names
# YOUR CODE HERE

Index(['id', 'first_name', 'last_name', 'email', 'gender', 'uni_grad',
       'job_title', 'Income'],
      dtype='object')

In [105]:
## View the column data types of the Pandas DataFrame.
# Use the `dtypes` attribute to output the column names and data types
# YOUR CODE HERE

id            float64
first_name     object
last_name      object
email          object
gender         object
uni_grad       object
job_title      object
Income        float64
dtype: object

## Rename the columns of the Pandas DataFrame to "Person_ID", "First_Name", "Last_Name", "Email", "Gender", "University", "Occupation", "Salary".

In [106]:
columns = ["Person_ID", "First_Name", "Last_Name", "Email", "Gender", "University", "Occupation", "Salary"]

# Set the `columns` attribute to a new list of column names
# YOUR CODE HERE

# View the first five rows of the DataFrame
# YOUR CODE HERE

,Person_ID,First_Name,Last_Name,Email,Gender,University,Occupation,Salary
0,1.0,Keriann,Lenormand,klenormand0@businessinsider.com,Female,Aurora University,Nurse Practicioner,58135.0
1,2.0,Huntley,Rupke,hrupke1@reuters.com,Male,Osaka University of Economics,Project Manager,96053.0
2,3.0,Gorden,Dalgarnowch,gdalgarnowch2@microsoft.com,Male,Ludong University,Environmental Tech,59196.0
3,4.0,Cullie,NaN,cputten3@nymag.com,Male,Université des Sciences et de la Technologie d...,Legal Assistant,88493.0
4,5.0,Ariel,Strangman,astrangman4@bravesites.com,Female,Boise State University,Project Manager,89073.0

## Alternatively, rename the columns of the Pandas DataFrame using a Dictionary.

In [107]:
# Use the `rename` function and set the `columns` parameter to a dictionary of new column names
# YOUR CODE HERE

# View the first five rows of the DataFrame
# YOUR CODE HERE

,Person_ID,First_Name,Last_Name,Email,Gender,University,Occupation,Salary
0,1.0,Keriann,Lenormand,klenormand0@businessinsider.com,Female,Aurora University,Nurse Practicioner,58135.0
1,2.0,Huntley,Rupke,hrupke1@reuters.com,Male,Osaka University of Economics,Project Manager,96053.0
2,3.0,Gorden,Dalgarnowch,gdalgarnowch2@microsoft.com,Male,Ludong University,Environmental Tech,59196.0
3,4.0,Cullie,NaN,cputten3@nymag.com,Male,Université des Sciences et de la Technologie d...,Legal Assistant,88493.0
4,5.0,Ariel,Strangman,astrangman4@bravesites.com,Female,Boise State University,Project Manager,89073.0

## Re-order the columns of the Pandas DataFrame to "Person_ID", "Last_Name", "First_Name", "Gender", "University", "Occupation", "Salary", "Email".

In [108]:
# Use a list of re-ordered column names to alter the column order of the original DataFrame
# YOUR CODE HERE

# View the first five rows of the DataFrame
# YOUR CODE HERE

,Person_ID,Last_Name,First_Name,Gender,University,Occupation,Salary,Email
0,1.0,Lenormand,Keriann,Female,Aurora University,Nurse Practicioner,58135.0,klenormand0@businessinsider.com
1,2.0,Rupke,Huntley,Male,Osaka University of Economics,Project Manager,96053.0,hrupke1@reuters.com
2,3.0,Dalgarnowch,Gorden,Male,Ludong University,Environmental Tech,59196.0,gdalgarnowch2@microsoft.com
3,4.0,NaN,Cullie,Male,Université des Sciences et de la Technologie d...,Legal Assistant,88493.0,cputten3@nymag.com
4,5.0,Strangman,Ariel,Female,Boise State University,Project Manager,89073.0,astrangman4@bravesites.com

## Bonus - If you complete the first part of this activity early, attempt this bonus section.

### Create two additional columns: `Age` and `Age_Copy`. Use the `randint` function from the `numpy` library with the `low`, `high`, and `size` parameters set to `22`, `65`, and `1000`, respectively, to randomly generate an integer from 22 to 65 for 1000 rows.

In [109]:
# Use the `randint` function to randomly generate an `Age` from 22 to 65 for 1000 rows
# YOUR CODE HERE
# YOUR CODE HERE

# View the first five rows of the DataFrame
# YOUR CODE HERE

,Person_ID,Last_Name,First_Name,Gender,University,Occupation,Salary,Email,Age,Age_Copy
0,1.0,Lenormand,Keriann,Female,Aurora University,Nurse Practicioner,58135.0,klenormand0@businessinsider.com,28,43
1,2.0,Rupke,Huntley,Male,Osaka University of Economics,Project Manager,96053.0,hrupke1@reuters.com,40,50
2,3.0,Dalgarnowch,Gorden,Male,Ludong University,Environmental Tech,59196.0,gdalgarnowch2@microsoft.com,36,23
3,4.0,NaN,Cullie,Male,Université des Sciences et de la Technologie d...,Legal Assistant,88493.0,cputten3@nymag.com,30,39
4,5.0,Strangman,Ariel,Female,Boise State University,Project Manager,89073.0,astrangman4@bravesites.com,27,59

### Delete the newly created `Age_Copy` column.

In [110]:
# Use the `drop` function to delete the newly created `Age_Copy` column
# YOUR CODE HERE

# View the first five rows of the DataFrame
# YOUR CODE HERE

,Person_ID,Last_Name,First_Name,Gender,University,Occupation,Salary,Email,Age
0,1.0,Lenormand,Keriann,Female,Aurora University,Nurse Practicioner,58135.0,klenormand0@businessinsider.com,28
1,2.0,Rupke,Huntley,Male,Osaka University of Economics,Project Manager,96053.0,hrupke1@reuters.com,40
2,3.0,Dalgarnowch,Gorden,Male,Ludong University,Environmental Tech,59196.0,gdalgarnowch2@microsoft.com,36
3,4.0,NaN,Cullie,Male,Université des Sciences et de la Technologie d...,Legal Assistant,88493.0,cputten3@nymag.com,30
4,5.0,Strangman,Ariel,Female,Boise State University,Project Manager,89073.0,astrangman4@bravesites.com,27

### Using the Pandas `to_csv` function, write the modified DataFrame to a new CSV, and put the file in the `Resources` folder.

In [111]:
# Save the DataFrame to the `Resources` folder
# YOUR CODE HERE

# ================================

### Rating Class Objectives

* rate your understanding using 1-5 method in each objective

In [ ]:
objectives = [
    "Work comfortably in the JupyterLab IDE",
    "Understand the relationship between Python and Pandas",
    "Understand the benefits of Pandas over spreadsheets to manipulate data for financial use cases",
    "Create Pandas Series and DataFrame structures from scratch and be able to manipulate them",
    "Create DataFrames from CSV files",
]
rating = []
total = 0
for i in range(len(objectives)):
    rate = input(objectives[i]+"? ")
    total += int(rate)
    rating.append(objectives[i] + ". (" + rate + "/5)")
print("="*96)
print("My rating today is:")
print("-"*24)
for i in rating:
    print(i)
print("-"*64)
print("Average: " + str(total/len(objectives)))